---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWideFlange.BoltDiameter
source: html/4aa7f0e0-be83-326b-81ca-f0aa3db6ac97.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWideFlange.BoltDiameter Property

Maximum bolt hole diameter, in. (mm)

## Syntax (C#)
```csharp
public double BoltDiameter { get; set; }
```